### START HERE ###
# Fire up Python3.7 with all your goodies
# source venv/bin/activate
# Fire up your REPL
# ipython --log-level=DEBUG
# Drop everything else below in it
####
#### DE-SERIALIZE LEMMATA ####
# use goodness: https://ipython.org/ipython-doc/3/config/extensions/autoreload.html
%load_ext autoreload
%autoreload 2
clean_lemmata_path = "/Users/paul/cltk_data/greek/text/real_chrysostom_corpus/ALL_REAL_JOHN_CLEAN_LEMMAS.TXT"
file = open(clean_lemmata_path)
lemmata = file.read().split('|')
file.close()

#assert len(lemmata) == 1871631 #no lemmata lost in round-trip to disk.
#### START REAL WORK ####
##LDA Proprocessing (Cleaning, Tokenizing, and Lemmatizing done)
#1. LDA wants a List of Lists of words (= document), I will make each sentence a document
from cltk.tokenize.word import WordTokenizer
tokenizer = WordTokenizer('greek')
lda_documents = " ".join(lemmata).split(".")
lda_documents = [tokenizer.tokenize(doc) for doc in lda_documents]

#2. Compute bigrams
from gensim.models import Phrases
# Add bigrams and trigrams to docs (only ones that appear 20 times or more).
bigram = Phrases(lda_documents, min_count=20)
for idx in range(len(lda_documents)):
    for token in bigram[lda_documents[idx]]:
        if '_' in token:
            # Token is a bigram, add to document.
            lda_documents[idx].append(token)

#3. Remove rare and common tokens (Filter out words that occur less than 20 documents, or more than 50% of the documents)
from gensim.corpora import Dictionary
lda_dictionary = Dictionary(lda_documents)
lda_dictionary.filter_extremes(no_below=20, no_above=0.5)

#4. Vectorize documents into Bag-of-words.
lda_corpus = [lda_dictionary.doc2bow(doc) for doc in lda_documents]
#Let’s see how many tokens and documents we have to train on.
print('Number of unique tokens: %d' % len(lda_dictionary))
print('Number of documents: %d' % len(lda_corpus))
#Number of unique tokens: 6111
#Number of documents: 141400

#5. Train LDA model.
# https://radimrehurek.com/gensim/auto_examples/tutorials/run_lda.html#sphx-glr-auto-examples-tutorials-run-lda-py
import logging
logging.basicConfig(format='%(asctime)s : %(levelname)s : %(message)s', level=logging.INFO)
from gensim.models import LdaModel

# Set training parameters.
num_topics = 15
chunksize = 1500
passes = 20
iterations = 400
eval_every = None  # Don't evaluate model perplexity, takes too much time.

# Make a index to word dictionary.
temp = lda_dictionary[0]  # This is only to "load" the lda_dictionary.
id2word = lda_dictionary.id2token

model = LdaModel(
    corpus=lda_corpus,
    id2word=id2word,
    chunksize=chunksize,
    alpha='auto',
    eta='auto',
    iterations=iterations,
    num_topics=num_topics,
    passes=passes,
    eval_every=eval_every
)

top_topics = model.top_topics(lda_corpus) #, num_words=20)

# Average topic coherence is the sum of topic coherences of all topics, divided by the number of topics.
avg_topic_coherence = sum([t[1] for t in top_topics]) / num_topics
print('Average topic coherence: %.4f.' % avg_topic_coherence)
from pprint import pprint
pprint(top_topics)
############### Lesson Learned from LDA ###############
#1. You have to understand what the hell its for, if it is going to help you
#2. Tuning this shit is *hard* and takes time. I got very few coherent topics. I am just guessing at the params
#3. Don't do anymore of this unless you know what you want to get out of the other side (and that it's possible!)
 ([(0.10617686, 'ἐρῶ'),
   (0.073693745, 'ψυχή'),
   (0.06741073, 'μηδὲν'),
   (0.06031233, 'βιόω'),
   (0.059242394, 'ἡμέτερος'),
   (0.041814428, 'μέσος'),
   (0.040532313, 'κρίνω'),
   (0.035104558, 'διάβολος'),
   (0.031365618, 'φύσις'),
   (0.02977673, 'παῖς'),
   (0.02770282, 'παιδεύω'),
   (0.024348363, 'δόγμα'),
   (0.023740765, 'σαυτοῦ'),
   (0.023623912, 'φυλάσσω'),
   (0.023146627, 'πλὴν'),
   (0.019303143, 'προαίρεσις'),
   (0.017195133, 'κέρδος'),
   (0.01709051, 'ἀρετὴν'),
   (0.016897297, 'ἐλάσσων'),
   (0.01625147, 'θορυβέω')],
##############
average topic coherence: -5.0363.
[([(0.10264483, 'χριστός'),
   (0.086318724, 'πνεῦμα'),
   (0.08069911, 'χάρις'),
   (0.07166107, 'οὔτε'),
   (0.06270898, 'ἅγιος'),
   (0.05181385, 'αἰών'),
   (0.05078009, 'ἰησοῦς'),
   (0.046648692, 'ἀεὶ'),
   (0.03547383, 'φιλανθρωπία'),
   (0.028348247, 'μεθ'),
   (0.027896823, 'ἐπιτυγχάνω'),
   (0.027260175, "μεθ_'"),
   (0.020797903, 'δοκέω'),
   (0.019987902, 'ἵημι'),
   (0.01872227, 'κύριος'),
   (0.017347075, 'αἰών_αἰών'),
   (0.016856173, 'κύριος_ἰησοῦς'),
   (0.01647025, 'πατρὶ'),
   (0.016409297, 'ἅμα'),
   (0.014224256, 'χάρις_φιλανθρωπία')],
  -1.7227812781043428),
 ([(0.046731267, 'ποιέω'),
   (0.042492375, 'εἶπον'),
   (0.041363437, 'ἐκεῖνος'),
   (0.030299978, 'οὖν'),
   (0.02891735, 'ὁράω'),
   (0.027736388, 'μόνος'),
   (0.027450413, 'πως'),
   (0.026723702, 'αὐτὸν'),
   (0.024294222, 'πάλιν'),
   (0.020360865, 'ἐνταῦθα'),
   (0.01985576, 'δέω1'),
   (0.019800613, 'αὐτοὺς'),
   (0.019375946, 'δείκνυμι'),
   (0.018329442, 'μᾶλλον'),
   (0.01817755, 'κενόω'),
   (0.017176103, 'βούλομαι'),
   (0.016245253, 'λόγος'),
   (0.015914561, 'τότε'),
   (0.01566256, 'ἐπειδὴ'),
   (0.014408741, 'δοκέω')],
  -2.7799818508463767),
 ([(0.055639524, 'τοιοῦτος'),
   (0.05466105, 'οὐδὲν'),
   (0.05147502, 'κἂν'),
   (0.045584913, 'δύναμαι'),
   (0.02877901, 'πάσχω'),
   (0.023581844, 'ἐργάζομαι'),
   (0.022805074, 'θεάω'),
   (0.021416336, 'πείθω'),
   (0.020603478, 'θεὸν'),
   (0.019429274, 'δύναμις'),
   (0.019253599, 'κακόω'),
   (0.01858309, 'ὁμόω'),
   (0.017614555, 'ἄξιος'),
   (0.016377728, 'ἐναντίος'),
   (0.016181428, 'μηδὲν'),
   (0.015549917, 'ἡμέτερος'),
   (0.01531449, 'αὐτὰ'),
   (0.014426363, 'δεσπότης'),
   (0.014273581, 'ἔργνυμι'),
   (0.014141915, 'οὐδείς')],
  -3.653479865405155),
 ([(0.06979776, 'ἑαυτοῦ'),
   (0.061744723, 'τοίνυν'),
   (0.04031104, 'μηδὲ'),
   (0.029785626, 'ψυχή'),
   (0.024769757, 'πολλάκις'),
   (0.023152813, 'χρῆμα'),
   (0.023076974, 'ἀπαλλάσσω'),
   (0.019793792, 'ἀνάγκη'),
   (0.018272359, 'σωτηρία'),
   (0.017919129, 'τυγχάνω'),
   (0.01779918, 'σπουδάζω'),
   (0.017390294, 'ἑαυτοὺς'),
   (0.015097864, 'κακία'),
   (0.014983249, 'κατέχω'),
   (0.014936763, 'καταφρονέω'),
   (0.014734476, 'διάβολος'),
   (0.013927878, 'κατορθόω'),
   (0.013155255, 'ἀρετάω'),
   (0.012830215, 'ἀφίστημι'),
   (0.012683034, 'ἐπιθυμιάω')],
  -3.900485263038744),
 ([(0.06192308, 'εἶδον'),
   (0.031872615, 'σῶμα'),
   (0.029948613, 'φέρω'),
   (0.029930783, 'καθά'),
   (0.027901454, 'ἀφίημι'),
   (0.017734572, 'φαίνω'),
   (0.01717775, 'οἰκία'),
   (0.01713178, 'ἀπολαύω'),
   (0.016928215, 'οἷος'),
   (0.014457028, 'ψυχὴν'),
   (0.013386765, 'χαλεπός'),
   (0.011981753, 'πλοῦτος'),
   (0.011209098, 'ἱμάτιον'),
   (0.010684171, 'παῖς'),
   (0.010509197, 'πενία'),
   (0.01020238, 'δόξα'),
   (0.009812101, 'τρέφω'),
   (0.009425091, 'κεῖμαι'),
   (0.009344129, 'πονηρός'),
   (0.009017336, 'μύρω')],
  -3.9415642359205116),
 ([(0.11124045, 'θεάομαι'),
   (0.098860696, 'φησὶν'),
   (0.06581884, 'θεὸς'),
   (0.0574626, 'κύριος'),
   (0.04369414, 'διὸ'),
   (0.036170103, 'ἐθέλω'),
   (0.03414765, 'ἀγαπάω'),
   (0.029206673, 'θεός'),
   (0.022472033, 'γοῦν'),
   (0.022119354, 'κόσμος'),
   (0.019681042, 'ἵημι'),
   (0.01957361, 'υἱός'),
   (0.018722825, 'γιγνώσκω'),
   (0.018104238, 'ὃν'),
   (0.017921304, 'ἀλλήλων'),
   (0.017221902, 'ἄρον'),
   (0.013279312, "ἐφ_'"),
   (0.013279312, 'ἐφ'),
   (0.012164871, 'ἀβραὰμ'),
   (0.01208006, 'υἱὸς')],
  -4.428691542642316),
 ([(0.12428274, 'ἕτερος'),
   (0.071704544, 'ὥσπερ'),
   (0.034806915, 'πλέω'),
   (0.03461249, 'ζητέω'),
   (0.03172674, 'εὑρίσκω'),
   (0.02953151, 'ποτέ'),
   (0.028787851, 'πολλὰ'),
   (0.026631137, 'ἀνά'),
   (0.02487924, 'αὐτοὶ'),
   (0.021351425, 'προστίθημι'),
   (0.020464174, 'ἐκβάλλω'),
   (0.018475518, 'σημεῖον'),
   (0.018224765, 'οὐκέτι'),
   (0.017530853, 'ἰδοὺ'),
   (0.017372856, 'ἐοικότως'),
   (0.017314421, 'λυπέω'),
   (0.015837526, 'ἐγκαλέω'),
   (0.014936439, 'τίκτω'),
   (0.014601669, 'ἓν'),
   (0.0143688405, 'θαῦμα')],
  -4.564798900842541),
 ([(0.068495266, 'ἔρχομαι'),
   (0.030154081, 'βασιλίς'),
   (0.028384726, 'ἐπ'),
   (0.028384726, "ἐπ_'"),
   (0.027795322, 'εἰσέρχομαι'),
   (0.027522879, 'ἀπέρχομαι'),
   (0.0244286, 'τόπος'),
   (0.022655988, 'τρόπος'),
   (0.02206873, 'ἐλπίς'),
   (0.018585276, 'ἐξέρχομαι'),
   (0.01858482, 'ἔσσομαι'),
   (0.01848947, 'νικάω'),
   (0.017278098, 'ἀγνοέω'),
   (0.01722936, 'παραγίγνομαι'),
   (0.017166186, 'στεφανόω'),
   (0.015931426, 'ἰσχύω'),
   (0.015782418, 'προσέρχομαι'),
   (0.014488927, 'πόλεμος'),
   (0.013814193, 'ἐπιτίθημι'),
   (0.012867593, 'ἅπτω')],
  -4.641283213236863),
 ([(0.08506182, 'παρ'),
   (0.08506182, "παρ_'"),
   (0.05230451, 'παρακαλέω'),
   (0.04175218, 'τιμάω'),
   (0.032788318, 'τιμωρία'),
   (0.030978922, 'πένης'),
   (0.030503955, 'κόλασις'),
   (0.02678971, 'ἀξιόω'),
   (0.026356965, 'ἀντὶ'),
   (0.024001537, 'ἐλεημοσύνη'),
   (0.021773085, 'δίκη'),
   (0.020636097, 'ἀπαιτέω'),
   (0.020090358, 'πλούσιος'),
   (0.01902996, 'ὅπως'),
   (0.018910075, 'συγγνώμη'),
   (0.014948739, 'πλουτέω'),
   (0.013141637, 'εὐεργεσία'),
   (0.012506316, 'δέω2'),
   (0.012485225, 'ἔλεος'),
   (0.01224098, 'εἰσφέρω')],
  -4.674550428594575),
 ([(0.07023614, 'γαῖα'),
   (0.058298387, 'οἰκέω'),
   (0.051887747, 'οὐρανός'),
   (0.047278702, 'πάρειμι1'),
   (0.032579932, 'ἐννοέω'),
   (0.028136028, 'ἄγγελος'),
   (0.026885882, 'πόλις'),
   (0.023035878, 'θλῖψις'),
   (0.021937104, 'ἄνω1'),
   (0.021381754, 'πόνος'),
   (0.018472495, 'βασίλειος'),
   (0.018471662, 'θλίβω'),
   (0.018186226, 'οὐρανὸν'),
   (0.017619628, 'μέρος'),
   (0.016356885, 'γλῶσσα'),
   (0.016299333, 'ἐπαγγέλλω'),
   (0.013665497, 'παράκλησις'),
   (0.0130581865, 'κάτος'),
   (0.012613325, 'βοάω'),
   (0.01183086, 'ἄνεσις')],
  -4.787221090400931),
 ([(0.12643132, 'φησὶ'),
   (0.10552212, 'δίδωμι'),
   (0.060478672, 'ἐπάγω'),
   (0.059974387, 'ἁμαρτία'),
   (0.035921894, 'ἔθνος'),
   (0.034146685, 'ἁμαρτάνω'),
   (0.02537925, 'ἀδελφός'),
   (0.02346097, 'κρίνω'),
   (0.022785064, 'παιδεύω'),
   (0.02222055, 'δικαιοσύνη'),
   (0.017551363, 'μετάνοια'),
   (0.017500611, 'μιμνήσκω'),
   (0.017457034, 'ἐξουσία'),
   (0.017271074, 'εἶμι'),
   (0.016718518, 'ἀπ'),
   (0.016718518, "ἀπ_'"),
   (0.015247331, 'σεύω'),
   (0.0144536635, 'σαρκάω'),
   (0.012321646, 'κρίσις'),
   (0.011883809, 'ἅπαξ')],
  -4.943347555682326),
 ([(0.15010671, 'τὰς'),
   (0.04398174, 'ἐπεὶ'),
   (0.036062986, 'βιόω'),
   (0.03235841, 'διάνοια'),
   (0.021775857, 'συνεχής'),
   (0.021638973, 'πληρόω'),
   (0.02042645, 'εἰσάγω'),
   (0.018051237, 'διηνεκής'),
   (0.016101088, 'ἐγείρω'),
   (0.016082851, 'χαίρω'),
   (0.015110301, 'ἡδονά'),
   (0.01383573, 'ὑπόθεσις'),
   (0.013793735, 'φωνέω'),
   (0.013355818, 'δόγμα'),
   (0.013308831, 'παρθένος'),
   (0.01287889, 'πολιτεία'),
   (0.01199391, 'ἐφίστημι'),
   (0.011400774, 'δοξάζω'),
   (0.011373217, 'καταλύω'),
   (0.010763808, 'οὐδέποτε')],
  -5.049558755349665),
 ([(0.13114646, 'ὅταν'),
   (0.04073431, 'ὅστε'),
   (0.033835843, 'μυρίος'),
   (0.03137935, 'ἀπόλλυμι'),
   (0.028708387, 'θάνατος'),
   (0.026436908, 'ἀναιρέω'),
   (0.026401414, 'φοβέω'),
   (0.026125232, 'κολάζω'),
   (0.024171384, 'φόβος'),
   (0.020945653, 'ὑπομένω'),
   (0.020520281, 'ὑβρίζω'),
   (0.019849941, 'δείδω'),
   (0.019299584, 'κίνδυνος'),
   (0.019261418, 'ἀδικέω'),
   (0.018353518, 'αἱρέω'),
   (0.016095906, 'αἰσχύνω'),
   (0.015092177, 'βʹ'),
   (0.013189179, 'ἐχθρός'),
   (0.012421324, 'πολεμέω'),
   (0.012206847, 'ἀναγκάζω')],
  -5.145800331481506),
 ([(0.11208723, 'ἥμερος'),
   (0.09380065, 'ἐκεῖ'),
   (0.065348916, "καθ_'"),
   (0.065348916, 'καθ'),
   (0.06343759, 'ἕκαστος'),
   (0.04463314, 'σώζω'),
   (0.038648665, 'μετ'),
   (0.038648665, "μετ_'"),
   (0.036769144, 'ἀνάστασις'),
   (0.026046509, 'εὔχομαι'),
   (0.025081664, 'πέτρος'),
   (0.024283338, 'ἀκρίβεια'),
   (0.021449253, 'μὴν'),
   (0.018037839, 'παύω'),
   (0.016133826, 'εὐχαριστέω'),
   (0.015444672, 'ἀναφέρω'),
   (0.01435142, 'αὐτὴ'),
   (0.013189558, 'οἰκονομέω'),
   (0.012495047, 'ἕκαστος_ἥμερος'),
   (0.0120165525, 'ἐκλύω')],
  -5.189751495322717),
 ([(0.1106219, 'τοσοῦτος'),
   (0.102596894, 'λαμβάνω'),
   (0.0773379, 'ὅσος'),
   (0.048200436, 'μένω'),
   (0.03270815, 'μέσος'),
   (0.021711957, 'λύω'),
   (0.020954981, 'μήτε'),
   (0.019525364, 'φεύγω'),
   (0.019426836, 'κωλύω'),
   (0.01884601, 'πάντως'),
   (0.016916387, 'τέλος'),
   (0.016194735, 'ὀφείλω'),
   (0.015450751, 'ἀρχὴν'),
   (0.014700973, 'φυλάσσω'),
   (0.0135103585, 'συγχωρέω'),
   (0.012135898, 'ἁρπάζω'),
   (0.011228062, 'αὐξάνω'),
   (0.0110301925, 'ξένος'),
   (0.011007936, 'ἀσθενέω'),
   (0.010726974, 'μνήμη')],
  -5.424434958876959),
 ([(0.09555967, 'νόμος'),
   (0.06722499, 'ῥῆμα'),
   (0.047143802, 'ἁμάρτημα'),
   (0.042922948, 'πόσος'),
   (0.031966995, 'κατ'),
   (0.031966995, "κατ_'"),
   (0.031819295, 'δικαιόω'),
   (0.026420977, 'αἰτέω'),
   (0.02032926, 'ὁμολογέω'),
   (0.018834062, 'πέμπω'),
   (0.018455833, 'ἐλεάω'),
   (0.017210985, 'ἐπισπάω'),
   (0.016511096, 'προσκυνέω'),
   (0.015723826, 'ἐκπίτνω'),
   (0.0140433125, 'φάος'),
   (0.013640433, 'δήποτε'),
   (0.013469438, 'σκότος'),
   (0.011917206, 'ὀνειδίζω'),
   (0.011340995, 'παῤῥησίαν'),
   (0.010894113, 'ἄρτος')],
  -6.535123948029827),
 ([(0.086138956, 'πίστις'),
   (0.061201263, 'πιστεύω'),
   (0.048794903, 'τοῦτό'),
   (0.046577487, 'ποῖος'),
   (0.03381158, 'πού'),
   (0.031935766, 'τουτέστιν'),
   (0.026356636, 'σκοπάω'),
   (0.023777775, 'προσέχω'),
   (0.023055485, 'ὄντως'),
   (0.02275548, 'θανατόω'),
   (0.022550212, 'χριστὸν'),
   (0.02199446, 'ἁμός'),
   (0.019805316, 'σταυρόω'),
   (0.019416884, 'ζωή'),
   (0.01907721, 'ἐπαγγελία'),
   (0.01887555, 'εὔκολος'),
   (0.018793667, 'διώκω'),
   (0.017006926, 'προσδοκάω'),
   (0.016299343, 'σήμερον'),
   (0.015724188, '!')],
  -6.893774415756179),
 ([(0.1349029, "δι_'"),
   (0.1349029, 'δι'),
   (0.057925407, 'ἐπιδείκνυμι'),
   (0.05112147, 'πολλὴν'),
   (0.03739849, 'ἠώς'),
   (0.03005636, 'οὐκοῦν'),
   (0.029550346, 'ἣν'),
   (0.025254184, 'δέομαι'),
   (0.025221715, 'ἕλλην'),
   (0.020948514, 'χαρίζομαι'),
   (0.019877965, 'πρόνοια'),
   (0.01607195, 'ὑμέτερος'),
   (0.015768446, 'τάχος'),
   (0.0130217085, 'ἀξίωμα'),
   (0.012798146, 'τρέω'),
   (0.0127692185, 'εἰσὶν'),
   (0.012471046, 'εὐλογέω'),
   (0.01190476, 'τιμὴν'),
   (0.011895068, 'ναὶ'),
   (0.0113091925, 'ἐλασσόω')],
  -7.127928655512971),
 ([(0.1366384, 'παῦλος'),
   (0.03898592, 'τουτέστι'),
   (0.037713956, 'θυσία'),
   (0.03585891, 'γράφω'),
   (0.031037804, 'ἐμοὶ'),
   (0.02964188, 'ἀλήθεια'),
   (0.028558152, 'προσφέρω'),
   (0.02666594, 'μακάριος'),
   (0.026457964, 'μαρτυρέω'),
   (0.024957921, 'δέχομαι'),
   (0.021366417, 'ομιλια'),
   (0.020538626, 'χειρόω'),
   (0.019600188, 'πολλὴ'),
   (0.019063056, 'μέλος'),
   (0.016925218, 'κρείσσων'),
   (0.016512193, 'μαρτυρία'),
   (0.01548313, 'ἀποδείκνυμι'),
   (0.015011707, 'τύπος'),
   (0.013498099, 'περιουσία'),
   (0.013405707, 'ἄπιστος')],
  -7.6037078487909175),
 ([(0.2840799, 'ἵνα'),
   (0.06397244, 'μανθάνω'),
   (0.04915914, 'ἕνεκα'),
   (0.031069977, 'διδάσκω'),
   (0.024107791, 'πρόσωπον'),
   (0.0233139, 'γνώμη'),
   (0.021847382, 'σαφής'),
   (0.021622, 'αʹ'),
   (0.02108323, 'γʹ'),
   (0.01887069, 'μωϋσῆς'),
   (0.017721482, 'οἶκος'),
   (0.017718524, 'ἵνα_μανθάνω'),
   (0.016377883, 'ιὤαννης'),
   (0.016316043, 'ἐρωτάω'),
   (0.015119482, "ἀφ_'"),
   (0.015119482, 'ἀφ'),
   (0.0140959285, 'δαυῒδ'),
   (0.013496833, 'διαθήκη'),
   (0.012340163, 'ῥάιδιος'),
   (0.011398794, 'ἔξεστι')],
  -7.717404095288809)]




##Word2Vec
import logging
logging.basicConfig(format='%(asctime)s : %(levelname)s : %(message)s', level=logging.INFO)


#Question: What are the sims for Prosoche, Fualke, Nepsis?






































## I cannot use CLTK pre-trained Word2Vec models because...
## They didn't pay thier github LTF storage bill, so I can't pull the models down.
## All it took was 2 hours of debugging to figure it out!! Huzzah! Bastards.
## TODO: Should I tell them? Would they even care?
#from cltk.vector.word2vec import get_sims
#prosoche_sims = get_sims('προσοχή', 'greek', lemmatized=True, threshold=0.7)
#print(prosoche_sims)
